
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЗаменятьПрефиксыСуффиксыПриИзменении(Элемент)
	
	Если Не ЗаменятьПрефиксыСуффиксы Тогда
		ЗаполнитьПрефиксСуффиксПоУмолчанию();
	КонецЕсли;
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьИсходныхФайловНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ДиалогВыбораКаталогаЗавершение", ЭтотОбъект, "Загрузка");
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = НСтр("ru='Выбор каталога исходных файлов:'");
	
	ДиалогВыбора.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ПутьСохраненияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка)
	
	Оповещение = Новый ОписаниеОповещения("ДиалогВыбораКаталогаЗавершение", ЭтотОбъект, "Сохранение");
	
	ДиалогВыбора = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбора.Заголовок = НСтр("ru='Выбор каталога сохранения файлов:'");
	
	ДиалогВыбора.Показать(Оповещение);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АдаптироватьКонфигурацию(Команда)
	
	ОчиститьСообщения();
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;
	
	АдресФайлаАрхива = АдресФайлаАрхива(ПутьИсходныхФайлов, УникальныйИдентификатор);
	
	НастройкиАффиксов = НастройкиАффиксов();
	АдресКонфигурации = АдресАдаптированнойКонфигурации(АдресФайлаАрхива, НастройкиАффиксов, УникальныйИдентификатор);
	
	ДвоичныеДанныеКонфигурации = ПолучитьИзВременногоХранилища(АдресКонфигурации);
	
	ДвоичныеДанныеКонфигурации.Записать(СтрШаблон("%1\AuroraLib.zip", ПутьСохранения));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияЗаполнениеФормы

&НаСервере
Процедура ИнициализироватьФорму()
	
	ЗаполнитьПрефиксСуффиксПоУмолчанию();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПрефиксСуффиксПоУмолчанию()
	
	Префикс = ПрефиксКонфигурации();
	Суффикс = СуффиксКонфигурации();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПрефиксКонфигурации()
	Возврат "аа_";
КонецФункции

&НаСервереБезКонтекста
Функция СуффиксКонфигурации()
	Возврат " (АА)";
КонецФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ГруппаПрефиксСуффиксПраво.Доступность = ЗаменятьПрефиксыСуффиксы;
	
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура ДиалогВыбораКаталогаЗавершение(Путь, Режим) Экспорт
	
	Если ТипЗнч(Путь) = Тип("Массив")
		И Путь.Количество() > 0 Тогда
		
		Если ВРег(Режим) = ВРег("Загрузка") Тогда
			ПутьИсходныхФайлов = Путь[0];
		КонецЕсли;
		
		Если ВРег(Режим) = ВРег("Сохранение") Тогда
			ПутьСохранения = Путь[0];
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция АдресАдаптированнойКонфигурации(Знач АдресФайлаАрхива, Знач НастройкиАффиксов, Знач УникальныйИдентификатор)
	
	ИмяАрхиваИсходныхФайлов = ПолучитьИмяВременногоФайла(".zip");
	
	ДвоичныеДанныеФайлаАрхива = ПолучитьИзВременногоХранилища(АдресФайлаАрхива);
	ДвоичныеДанныеФайлаАрхива.Записать(ИмяАрхиваИсходныхФайлов);
	
	ИмяКаталогаИзвлечения = ПолучитьИмяВременногоФайла();
	
	ЧтениеФайла = Новый ЧтениеФайлаАрхива(ИмяАрхиваИсходныхФайлов);
	ЧтениеФайла.ИзвлечьВсе(ИмяКаталогаИзвлечения, РежимВосстановленияПутейФайлаАрхива.Восстанавливать);
	ЧтениеФайла.Закрыть();
	
	УдалитьФайлы(ИмяАрхиваИсходныхФайлов);
	
	ФайлыКонфигурации = НайтиФайлы(ИмяКаталогаИзвлечения, "*");
	ОбработатьФайлыКонфигурацииРекурсивно(ФайлыКонфигурации, НастройкиАффиксов);
	
	АдресФайлаАрхива = АдресФайлаАрхива(ИмяКаталогаИзвлечения, УникальныйИдентификатор);
	УдалитьФайлы(ИмяКаталогаИзвлечения);
	
	Возврат АдресФайлаАрхива;
	
КонецФункции

&НаСервереБезКонтекста
Процедура ОбработатьФайлыКонфигурацииРекурсивно(Знач ФайлыКаталога, Знач НастройкиАффиксов)
	
	Для Каждого ФайлКонфигурации Из ФайлыКаталога Цикл
		
		ЭтоКаталог = Не ЗначениеЗаполнено(ФайлКонфигурации.Расширение);
		
		ИтоговыйПутьФайла = ФайлКонфигурации.ПолноеИмя;
		Если НастройкиАффиксов.ЗаменятьПрефиксыСуффиксы
			И СтрНайти(ФайлКонфигурации.Имя, НастройкиАффиксов.ПрефиксКонфигурации)
			И НастройкиАффиксов.ПрефиксКонфигурации <> НастройкиАффиксов.Префикс Тогда
			
			НовоеИмяФайла = СтрЗаменить(ФайлКонфигурации.Имя, НастройкиАффиксов.ПрефиксКонфигурации, НастройкиАффиксов.Префикс);
			ИтоговыйПутьФайла = СтрШаблон("%1%2", ФайлКонфигурации.Путь, НовоеИмяФайла);
			
			Если ЭтоКаталог Тогда
				СоздатьКаталог(ИтоговыйПутьФайла);
				СкопироватьФайлыКаталогаРекурсивно(ФайлКонфигурации.ПолноеИмя, ИтоговыйПутьФайла);
				УдалитьФайлы(ФайлКонфигурации.ПолноеИмя);
			Иначе
				ПереместитьФайл(ФайлКонфигурации.ПолноеИмя, ИтоговыйПутьФайла);
			КонецЕсли;
			
		КонецЕсли;
		
		ЭтоКаталог = Не ЗначениеЗаполнено(ФайлКонфигурации.Расширение);
		
		Если ЭтоКаталог Тогда
			
			ФайлыДочернегоКаталога = НайтиФайлы(ИтоговыйПутьФайла, "*");
			ОбработатьФайлыКонфигурацииРекурсивно(ФайлыДочернегоКаталога, НастройкиАффиксов);
			
		Иначе
			
			ИмяВременногоФайла = ПолучитьИмяВременногоФайла();
			
			ЧтениеТекста = Новый ЧтениеТекста(ИтоговыйПутьФайла, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС, Символы.ПС);
			ЗаписьТекста = Новый ЗаписьТекста(ИмяВременногоФайла, КодировкаТекста.UTF8, Символы.ВК + Символы.ПС,, Символы.ПС);
			
			СтрокаФайла = ЧтениеТекста.ПрочитатьСтроку();
			Пока СтрокаФайла <> Неопределено Цикл
				
				СтрокаСЗаменойПрефикса = СтрЗаменить(
					СтрокаФайла, НастройкиАффиксов.ПрефиксКонфигурации, НастройкиАффиксов.Префикс);
				
				СтрокаСЗаменойАффикса = СтрЗаменить(
					СтрокаСЗаменойПрефикса, НастройкиАффиксов.СуффиксКонфигурации, НастройкиАффиксов.Суффикс);
				
				ЗаписьТекста.ЗаписатьСтроку(СтрокаСЗаменойАффикса, Символы.ВК + Символы.ПС);
				
				СтрокаФайла = ЧтениеТекста.ПрочитатьСтроку();
				
			КонецЦикла;
			
			ЧтениеТекста.Закрыть();
			ЗаписьТекста.Закрыть();
			
			УдалитьФайлы(ИтоговыйПутьФайла);
			ПереместитьФайл(ИмяВременногоФайла, ИтоговыйПутьФайла);
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция НастройкиАффиксов()
	
	Результат = Новый Структура;
	Результат.Вставить("ЗаменятьПрефиксыСуффиксы", ЗаменятьПрефиксыСуффиксы);
	Результат.Вставить("Префикс", Префикс);
	Результат.Вставить("Суффикс", Суффикс);
	Результат.Вставить("ПрефиксКонфигурации", ПрефиксКонфигурации());
	Результат.Вставить("СуффиксКонфигурации", СуффиксКонфигурации());
	
	Возврат Результат;
	
КонецФункции

&НаСервереБезКонтекста
Функция АдресФайлаАрхива(Знач ПутьФайлов, Знач УникальныйИдентификтор)
	
	ИмяФайлаАрхива = ПолучитьИмяВременногоФайла(".zip");
	
	ЗаписьФайла = Новый ЗаписьФайлаАрхива(ИмяФайлаАрхива);
	
	ЗаписьФайла.Добавить(
		СтрШаблон("%1\*", ПутьФайлов),
		РежимСохраненияПутейФайлаАрхива.СохранятьОтносительныеПути,
		РежимОбработкиПодкаталоговФайлаАрхива.ОбрабатыватьРекурсивно);
	
	ЗаписьФайла.Записать();
	
	ДвоичныеДанныеАрхива = Новый ДвоичныеДанные(ИмяФайлаАрхива);
	АдресДвоичныхДанныхАрхива = ПоместитьВоВременноеХранилище(ДвоичныеДанныеАрхива, УникальныйИдентификтор);
	
	УдалитьФайлы(ИмяФайлаАрхива);
	
	Возврат АдресДвоичныхДанныхАрхива;
	
КонецФункции

&НаСервереБезКонтекста
Процедура СкопироватьФайлыКаталогаРекурсивно(Знач ПутьИсточник, Знач ПутьПриемник);
	
	ФайлыИсточника = НайтиФайлы(ПутьИсточник, "*");
	Для Каждого ФайлИсточник Из ФайлыИсточника Цикл
		
		ЭтоКаталог = Не ЗначениеЗаполнено(ФайлИсточник.Расширение);
		
		ИтоговыйПутьФайла = СтрЗаменить(ФайлИсточник.ПолноеИмя, ПутьИсточник, ПутьПриемник);
		Если ЭтоКаталог Тогда
			
			СоздатьКаталог(ИтоговыйПутьФайла);
			СкопироватьФайлыКаталогаРекурсивно(ФайлИсточник.ПолноеИмя, ИтоговыйПутьФайла);
			
		Иначе
			ПереместитьФайл(ФайлИсточник.ПолноеИмя, ИтоговыйПутьФайла);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
