
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнициализироватьФорму();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПодключаемыйНастройкаНажатие(Элемент)
	
	УИДНастройкиСтрокой = СтрЗаменить(СтрЗаменить(Элемент.Имя, "_", "-"), "Настройка", "");
	УИДНастройки = Новый УникальныйИдентификатор(УИДНастройкиСтрокой);
	
	Настройка = НастройкаПоУИД(УИДНастройки);
	
	ПоказатьЗначение(, Настройка);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ИнициализироватьФорму()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	аа_ПредопределенныеЗначения.Ссылка КАК Ссылка,
		|	аа_ПредопределенныеЗначения.Наименование КАК Наименование,
		|	аа_ПредопределенныеЗначения.Описание КАК Описание,
		|	аа_ПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа,
		|	аа_ПредопределенныеЗначения.Родитель КАК Родитель
		|ИЗ
		|	ПланВидовХарактеристик.аа_ПредопределенныеЗначения КАК аа_ПредопределенныеЗначения
		|ГДЕ
		|	НЕ аа_ПредопределенныеЗначения.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	аа_ПредопределенныеЗначения.УровеньИерархии";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	КэшФормы = КэшИнициализацииФормы();
	Пока Выборка.Следующий() Цикл
		
		Если Выборка.ЭтоГруппа Тогда
			ДобавитьГруппуНастроек(Выборка, КэшФормы);
		Иначе
			ДобавитьЭлементНастройки(Выборка, КэшФормы);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция КэшИнициализацииФормы()
	
	Кэш = Новый Структура();
	Кэш.Вставить("ЭлементыФормы", Новый Соответствие);
	
	Возврат Кэш;
	
КонецФункции

&НаСервере
Процедура ДобавитьГруппуНастроек(ОписаниеНастройки, КэшФормы)
	
	Родитель = Элементы.ГруппаНастройки;
	Если ЗначениеЗаполнено(ОписаниеНастройки.Родитель) Тогда
		Родитель = КэшФормы.ЭлементыФормы.Получить(ОписаниеНастройки.Родитель);
	КонецЕсли;
	
	ИмяГруппы = СтрЗаменить("Группа" + ОписаниеНастройки.Ссылка.УникальныйИдентификатор(), "-", "_");
	
	СвойстваГруппыОсновная = Новый Структура;
	СвойстваГруппыОсновная.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
	СвойстваГруппыОсновная.Вставить("Поведение", ПоведениеОбычнойГруппы.Свертываемая);
	СвойстваГруппыОсновная.Вставить("ОтображениеУправления", ОтображениеУправленияОбычнойГруппы.Картинка);
	СвойстваГруппыОсновная.Вставить("Отображение", ОтображениеОбычнойГруппы.ОбычноеВыделение);
	СвойстваГруппыОсновная.Вставить("ОтображатьОтступСлева", Истина);
	СвойстваГруппыОсновная.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	
	ДобавитьГруппуФормы(ИмяГруппы, СвойстваГруппыОсновная, ОписаниеНастройки.Наименование, Родитель);
	Элементы[ИмяГруппы].Скрыть();
	
	НоваяДекорация = Элементы.Добавить(ИмяГруппы + "Описание", Тип("ДекорацияФормы"), Элементы[ИмяГруппы]);
	НоваяДекорация.Заголовок = ОписаниеНастройки.Описание;
	
	СвойстваГруппыКолонки = Новый Структура;
	СвойстваГруппыКолонки.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
	СвойстваГруппыКолонки.Вставить("ОтображатьЗаголовок", Ложь);
	СвойстваГруппыКолонки.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда);
	
	ИмяГруппыЛевоПраво = ИмяГруппы + "ЛевоПраво";
	ДобавитьГруппуФормы(
		ИмяГруппыЛевоПраво,
		СвойстваГруппыКолонки,
		ОписаниеНастройки.Наименование + " (колонки)",
		Элементы[ИмяГруппы]);
	
	СвойстваГруппыКолонка = Новый Структура;
	СвойстваГруппыКолонка.Вставить("Вид", ВидГруппыФормы.ОбычнаяГруппа);
	СвойстваГруппыКолонка.Вставить("ОтображатьЗаголовок", Ложь);
	СвойстваГруппыКолонка.Вставить("Группировка", ГруппировкаПодчиненныхЭлементовФормы.Вертикальная);
	СвойстваГруппыКолонка.Вставить("Ширина", 45);
	
	ДобавитьГруппуФормы(
		ИмяГруппы + "Лево",
		СвойстваГруппыКолонка,
		ОписаниеНастройки.Наименование + " (лево)",
		Элементы[ИмяГруппыЛевоПраво]);
	
	ДобавитьГруппуФормы(
		ИмяГруппы + "Право",
		СвойстваГруппыКолонка,
		ОписаниеНастройки.Наименование + " (право)",
		Элементы[ИмяГруппыЛевоПраво]);
	
	КэшФормы.ЭлементыФормы.Вставить(ОписаниеНастройки.Ссылка, Элементы[ИмяГруппы]);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьЭлементНастройки(ОписаниеНастройки, КэшФормы)
	
	Родитель = Элементы.ГруппаНастроекОбщие;
	Если ЗначениеЗаполнено(ОписаниеНастройки.Родитель) Тогда
		Родитель = КэшФормы.ЭлементыФормы.Получить(ОписаниеНастройки.Родитель);
	КонецЕсли;
	
	ГруппаНастроекЛево = Элементы[Родитель.Имя + "Лево"];
	ГруппаНастроекПраво = Элементы[Родитель.Имя + "Право"];
	
	ГруппаДляДобавления = ГруппаНастроекЛево;
	Если ГруппаНастроекЛево.ПодчиненныеЭлементы.Количество() > ГруппаНастроекПраво.ПодчиненныеЭлементы.Количество() Тогда
		ГруппаДляДобавления = ГруппаНастроекПраво;
	КонецЕсли;
	
	ИмяНастройки = СтрЗаменить("Настройка" + ОписаниеНастройки.Ссылка.УникальныйИдентификатор(), "-", "_");
	
	НоваяДекорация = Элементы.Добавить(ИмяНастройки, Тип("ДекорацияФормы"), ГруппаДляДобавления);
	НоваяДекорация.Заголовок = ОписаниеНастройки.Наименование;
	НоваяДекорация.Подсказка = ОписаниеНастройки.Описание;
	НоваяДекорация.ОтображениеПодсказки = ОтображениеПодсказки.ОтображатьСнизу;
	НоваяДекорация.Гиперссылка = Истина;
	НоваяДекорация.УстановитьДействие("Нажатие", "ПодключаемыйНастройкаНажатие");
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция НастройкаПоУИД(Знач УИДНастройки)
	
	Возврат ПланыВидовХарактеристик.аа_ПредопределенныеЗначения.ПолучитьСсылку(УИДНастройки);
	
КонецФункции

&НаСервере
Процедура ДобавитьГруппуФормы(ИмяГруппы, СвойстваГруппы, ЗаголовокГруппы = "", Родитель = Неопределено)
	
	НоваяГруппа = Элементы.Добавить(ИмяГруппы, Тип("ГруппаФормы"), Родитель);
	
	Для Каждого СвойствоГруппы Из СвойстваГруппы Цикл
		НоваяГруппа[СвойствоГруппы.Ключ] = СвойствоГруппы.Значение;
	КонецЦикла;
	
	НоваяГруппа.Заголовок = ЗаголовокГруппы;
	
КонецПроцедуры

#КонецОбласти
