
#Область ПрограммныйИнтерфейс

Функция ОписаниеПредопределенныхЗначений() Экспорт
	
	ПредопределенныеЗначения = ТаблицаПредопределенныхЗначений();
	
	аа_ПредопределенныеЗначенияПереопределяемый.ЗаполнитьПредопределенныеЗначения(ПредопределенныеЗначения);
	
	Возврат ПредопределенныеЗначения;
	
КонецФункции

Процедура АктуализироватьПредопределенныеЗначения() Экспорт
	
	ОписаниеПредопределенныхЗначений = ОписаниеПредопределенныхЗначений();
	
	КэшЗначений = КэшЗначений();
	ИнициализироватьКэшПредопределенныхЗначений(ОписаниеПредопределенныхЗначений, КэшЗначений);
	
	Для Каждого ПредопределенноеЗначение Из ОписаниеПредопределенныхЗначений Цикл
		
		ПВХОбъект = СоздатьОбновитьПредопределенноеЗначение(ПредопределенноеЗначение, КэшЗначений);
		
		ЗаписатьПредопределенноеЗначение(ПВХОбъект, КэшЗначений);
		
	КонецЦикла;
	
	ПометитьНаУдалениеУстаревшиеИдентификаторы(ОписаниеПредопределенныхЗначений);
	
КонецПроцедуры

Процедура ДобавитьГруппу(ОписаниеПредопределенных, Наименование, Идентификатор, Описание = "", ИдентификаторРодителя = Неопределено)
	
	НоваяГруппа = ОписаниеПредопределенных.Добавить();
	
	НоваяГруппа.Наименование 			= Наименование;
	НоваяГруппа.Описание 				= Описание;
	НоваяГруппа.Идентификатор 			= Идентификатор;
	НоваяГруппа.ИдентификаторРодителя 	= ИдентификаторРодителя;
	НоваяГруппа.ЭтоГруппа 				= Истина;
	
КонецПроцедуры

Процедура ДобавитьЗначение(ОписаниеПредопределенных, Наименование, Идентификатор, ТипЗначения, Описание = "", ИдентификаторРодителя = Неопределено)
	
	НовоеЗначение = ОписаниеПредопределенных.Добавить();
	
	НовоеЗначение.Наименование 				= Наименование;
	НовоеЗначение.Описание 					= Описание;
	НовоеЗначение.Идентификатор 			= Идентификатор;
	НовоеЗначение.ИдентификаторРодителя 	= ИдентификаторРодителя;
	НовоеЗначение.ТипЗначения 				= ТипЗначения;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция КэшЗначений()
	
	Результат = Новый Структура;
	Результат.Вставить("Группы", Новый Соответствие);
	Результат.Вставить("Значения", Новый Соответствие);
	
	Возврат Результат;
	
КонецФункции

Процедура ИнициализироватьКэшПредопределенныхЗначений(ОписаниеПредопределенныхЗначений, КэшЗначений)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПредопределенныеЗначения", ОписаниеПредопределенныхЗначений);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПредопределенныеЗначения.Идентификатор КАК Идентификатор,
		|	ПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа
		|ПОМЕСТИТЬ втПредопределенныеЗначения
		|ИЗ
		|	&ПредопределенныеЗначения КАК ПредопределенныеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	втПредопределенныеЗначения.Идентификатор КАК Идентификатор,
		|	втПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа,
		|	аа_ПредопределенныеЗначения.Ссылка КАК Ссылка
		|ИЗ
		|	втПредопределенныеЗначения КАК втПредопределенныеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.аа_ПредопределенныеЗначения КАК аа_ПредопределенныеЗначения
		|		ПО втПредопределенныеЗначения.Идентификатор = аа_ПредопределенныеЗначения.Идентификатор
		|			И втПредопределенныеЗначения.ЭтоГруппа = аа_ПредопределенныеЗначения.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Если Выборка.ЭтоГруппа Тогда
			КэшЗначений.Группы.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
		Иначе
			КэшЗначений.Значения.Вставить(Выборка.Идентификатор, Выборка.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Функция СсылкаНаПредопределенноеЗначение(Идентификатор, ЭтоГруппа, КэшЗначений)
	
	Возврат ?(ЭтоГруппа, КэшЗначений.Группы.Получить(Идентификатор), КэшЗначений.Значения.Получить(Идентификатор));
	
КонецФункции

Процедура ЗаписатьПредопределенноеЗначение(ПВХОбъект, КэшЗначений)
	
	ПВХОбъект.Записать();
	
	Если ПВХОбъект.ЭтоГруппа Тогда
		КэшЗначений.Группы.Вставить(ПВХОбъект.Идентификатор, ПВХОбъект.Ссылка);
	Иначе
		КэшЗначений.Значения.Вставить(ПВХОбъект.Идентификатор, ПВХОбъект.Ссылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеУстаревшиеИдентификаторы(ОписаниеПредопределенныхЗначений)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПредопределенныеЗначения", ОписаниеПредопределенныхЗначений);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПредопределенныеЗначения.Идентификатор КАК Идентификатор,
		|	ПредопределенныеЗначения.ЭтоГруппа КАК ЭтоГруппа
		|ПОМЕСТИТЬ втПредопределенныеЗначения
		|ИЗ
		|	&ПредопределенныеЗначения КАК ПредопределенныеЗначения
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	аа_ПредопределенныеЗначения.Ссылка КАК Ссылка
		|ИЗ
		|	ПланВидовХарактеристик.аа_ПредопределенныеЗначения КАК аа_ПредопределенныеЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ втПредопределенныеЗначения КАК втПредопределенныеЗначения
		|		ПО аа_ПредопределенныеЗначения.Идентификатор = втПредопределенныеЗначения.Идентификатор
		|			И аа_ПредопределенныеЗначения.ЭтоГруппа = втПредопределенныеЗначения.ЭтоГруппа
		|ГДЕ
		|	втПредопределенныеЗначения.Идентификатор ЕСТЬ NULL";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ПВХОбъект = Выборка.Ссылка.ПолучитьОбъект();
		ПВХОбъект.УстановитьПометкуУдаления(Истина, Ложь);
	КонецЦикла;
	
КонецПроцедуры

Функция СоздатьОбновитьПредопределенноеЗначение(ОписаниеПредопределенного, КэшЗначений)
	
	ЭтоНовый = Ложь;
	
	ПВХСсылка = СсылкаНаПредопределенноеЗначение(
		ОписаниеПредопределенного.Идентификатор, ОписаниеПредопределенного.ЭтоГруппа, КэшЗначений);
	
	Если Не ЗначениеЗаполнено(ПВХСсылка) Тогда
		
		ЭтоНовый = Истина;
		
		Если ОписаниеПредопределенного.ЭтоГруппа Тогда
			ПВХОбъект = ПланыВидовХарактеристик.аа_ПредопределенныеЗначения.СоздатьГруппу();
		Иначе
			ПВХОбъект = ПланыВидовХарактеристик.аа_ПредопределенныеЗначения.СоздатьЭлемент();
		КонецЕсли;
		
	Иначе
		ПВХОбъект = ПВХСсылка.ПолучитьОбъект();
	КонецЕсли;
	
	СписокСвойств = Неопределено;
	ИсключаяСвойства = "СписокЗначений";
	Если ОписаниеПредопределенного.ЭтоГруппа Тогда
		СписокСвойств = "Наименование, Идентификатор, Описание";
		ИсключаяСвойства = Неопределено;
	ИначеЕсли ЭтоНовый Тогда
		СписокСвойств = Неопределено;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ПВХОбъект, ОписаниеПредопределенного, СписокСвойств, ИсключаяСвойства);
	
	Если ЗначениеЗаполнено(ОписаниеПредопределенного.ИдентификаторРодителя) Тогда
		ПВХОбъект.Родитель = СсылкаНаПредопределенноеЗначение(
			ОписаниеПредопределенного.ИдентификаторРодителя, Истина, КэшЗначений);
	КонецЕсли;
	
	Если Не ПВХОбъект.ЭтоГруппа Тогда
		
		Если ПВХОбъект.ОдноЗначение
			И ПВХОбъект.Значения.Количество() > 1 Тогда
			
			Пока ПВХОбъект.Значения.Количество() > 1 Цикл
				ПВХОбъект.Значения.Удалить(ПВХОбъект.Значения.Индекс(ПВХОбъект.Значения[ПВХОбъект.Значения.Количество() - 1]));
			КонецЦикла;
			
		КонецЕсли;
		
		Если ПВХОбъект.ОдноЗначение Тогда
			ПВХОбъект.СписокЗначений = Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	ПВХОбъект.ПометкаУдаления = Ложь;
	
	Возврат ПВХОбъект;
	
КонецФункции

Функция ТаблицаПредопределенныхЗначений()
	
	ПредопределенныеЗначения = Новый ТаблицаЗначений;
	
	ПредопределенныеЗначения.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(150)));
	ПредопределенныеЗначения.Колонки.Добавить("Описание", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(1024)));
	ПредопределенныеЗначения.Колонки.Добавить("Идентификатор", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(333)));
	ПредопределенныеЗначения.Колонки.Добавить("ИдентификаторРодителя", Новый ОписаниеТипов("Строка",,,, Новый КвалификаторыСтроки(333)));
	ПредопределенныеЗначения.Колонки.Добавить("СписокЗначений", Новый ОписаниеТипов("Булево"));
	ПредопределенныеЗначения.Колонки.Добавить("ОдноЗначение", Новый ОписаниеТипов("Булево"));
	ПредопределенныеЗначения.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("ОписаниеТипов"));
	ПредопределенныеЗначения.Колонки.Добавить("ЭтоГруппа", Новый ОписаниеТипов("Булево"));
	
	Возврат ПредопределенныеЗначения;
	
КонецФункции

#КонецОбласти
