
#Область ПрограммныйИнтерфейс

// Возвращает массив со значениями предопределенных значений.
//
// Параметры:
//  Идентификатор - Строка - Идентификатор предопределеннго значения.
// 
// Возвращаемое значение:
//  Массив - Массив значений по идентификатору предопределенного значения.
//
Функция ЗначенияНастройки(Идентификатор) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Таблица.Значение КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.аа_ПредопределенныеЗначения.Значения КАК Таблица
		|ГДЕ
		|	Таблица.Ссылка.Идентификатор = &Идентификатор
		|	И НЕ Таблица.Ссылка.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти