
#Область ПрограммныйИнтерфейс

Функция ЗначенияНастройки(Идентификатор) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	аа_ПредопределенныеЗначенияЗначения.Значение КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.аа_ПредопределенныеЗначения.Значения КАК аа_ПредопределенныеЗначенияЗначения
		|ГДЕ
		|	аа_ПредопределенныеЗначенияЗначения.Ссылка.Идентификатор = &Идентификатор
		|	И НЕ аа_ПредопределенныеЗначенияЗначения.Ссылка.ЭтоГруппа";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти