
#Область СлужебныйПрограммныйИнтерфейс

// Обновляет список предопределенных значений. Добавляет новые, актуализирует свойства текущих, помечает на удаление устаревшие.
//
Процедура АктуализироватьПредопределенныеЗначения() Экспорт
	аа_ПредопределенныеЗначения.АктуализироватьПредопределенныеЗначения();
КонецПроцедуры

// Возвращает массив со значениями предопределенных значений.
//
// Параметры:
//  Идентификатор - Строка - Идентификатор предопределеннго значения.
// 
// Возвращаемое значение:
//  Массив - Массив значений по идентификатору предопределенного значения.
//
Функция ЗначенияНастройки(Идентификатор) Экспорт
	Возврат аа_ПредопределенныеЗначения.ЗначенияНастройки(Идентификатор);
КонецФункции

#КонецОбласти