
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ПриСозданииЧтенииНаСервере();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриСозданииЧтенииНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СписокЗначенийПриИзменении(Элемент)
	
	ПроверитьЗаполнитьПустоеЗначение();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыЗначения

#КонецОбласти

#Область ОбработчикиКомандФормы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьВидимостьДоступность()
	
	Элементы.ЗначенияЗначениеБезСписка.Видимость = Не Объект.СписокЗначений;
	Элементы.Значения.Видимость = Объект.СписокЗначений;
	
КонецПроцедуры

&НаСервере
Процедура ПроверитьЗаполнитьПустоеЗначение()
	
	Если Объект.Значения.Количество() = 0 Тогда
		Объект.Значения.Добавить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииЧтенииНаСервере()
	
	ПроверитьЗаполнитьПустоеЗначение();
	
	УстановитьВидимостьДоступность();
	
КонецПроцедуры

#КонецОбласти