
#Область СлужебныйПрограммныйИнтерфейс

// Использовать аа_ПредопределенныеЗначения.ЗначенияНастройки(Идентификатор).
//
Функция ЗначенияНастройки(Идентификатор) Экспорт
	
	Результат = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Идентификатор", Идентификатор);
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	аа_ПредопределенныеЗначенияЗначения.Значение КАК Значение
		|ИЗ
		|	ПланВидовХарактеристик.аа_ПредопределенныеЗначения КАК аа_ПредопределенныеЗначения
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ПланВидовХарактеристик.аа_ПредопределенныеЗначения.Значения КАК аа_ПредопределенныеЗначенияЗначения
		|		ПО аа_ПредопределенныеЗначения.Ссылка = аа_ПредопределенныеЗначенияЗначения.Ссылка
		|			И (аа_ПредопределенныеЗначения.Идентификатор = &Идентификатор)
		|			И (НЕ аа_ПредопределенныеЗначения.ЭтоГруппа)";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Результат.Добавить(Выборка.Значение);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти