
#Область ПрограммныйИнтерфейс

// Дополняет состав предопределенных значений.
// Для добавления предопределенных значений следует использовать:
// аа_ПредопределенныеЗначения.ДобавитьГруппу();
// аа_ПредопределенныеЗначения.ДобавитьЗначение();
//
// Параметры:
//  ПредопределенныеЗначения - ТаблицаЗначений - Таблица с описанием предопределенных значений. См. аа_ПредопределенныеЗначения.ТаблицаПредопределенныхЗначений().
//
Процедура ЗаполнитьПредопределенныеЗначения(ПредопределенныеЗначения) Экспорт
	
КонецПроцедуры

#КонецОбласти